
#### Terraform Format and Style 🖌  : `success`
#### Terraform Initialization ⚙ : `success`
#### Terraform Plan 📖 : `success`

<details><summary>Show Plan</summary>

``````module.s3.aws_route53_zone.baby-macioce: Refreshing state... [id=Z04297862RMBF7HTXKRLG]
module.s3.module.isbabymaciocehereyet.aws_s3_bucket.website_root: Refreshing state... [id=isbabymaciocehereyet.com-root]
module.s3.aws_s3_bucket.b: Refreshing state... [id=macioce-tf-test-bucket]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0b89592ea7423cf94]
module.s3.aws_route53_zone.nickmacioce: Refreshing state... [id=Z0408742MN1DB2L1IVKL]
module.s3.module.links-nickmacioce.aws_s3_bucket.website_root: Refreshing state... [id=links.nickmacioce.com-root]
module.s3.module.nickmacioce.aws_s3_bucket.website_root: Refreshing state... [id=nickmacioce.com-root]
module.s3.module.links-nickmacioce.aws_acm_certificate.wildcard_website: Refreshing state... [id=arn:aws:acm:us-east-1:153542816638:certificate/32e2ff15-f95f-4a15-91f4-4ab8cca0c89d]
module.s3.module.isbabymaciocehereyet.aws_acm_certificate.wildcard_website: Refreshing state... [id=arn:aws:acm:us-east-1:153542816638:certificate/74685574-5ab8-4b78-af76-9b9e1e2b5444]
module.s3.module.nickmacioce.aws_acm_certificate.wildcard_website: Refreshing state... [id=arn:aws:acm:us-east-1:153542816638:certificate/4e70f32a-ff67-4d20-a20a-d9acf9c6e1da]
module.s3.module.isbabymaciocehereyet.aws_s3_bucket_policy.update_website_root_bucket_policy: Refreshing state... [id=isbabymaciocehereyet.com-root]
module.s3.module.links-nickmacioce.aws_s3_bucket_policy.update_website_root_bucket_policy: Refreshing state... [id=links.nickmacioce.com-root]
module.s3.module.nickmacioce.aws_s3_bucket_policy.update_website_root_bucket_policy: Refreshing state... [id=nickmacioce.com-root]
module.s3.module.links-nickmacioce.aws_route53_record.wildcard_validation["links.nickmacioce.com"]: Refreshing state... [id=Z0408742MN1DB2L1IVKL__d501e5c61d85996ce4395a16dfc2859e.links.nickmacioce.com._CNAME]
module.s3.module.links-nickmacioce.aws_route53_record.wildcard_validation["*.links.nickmacioce.com"]: Refreshing state... [id=Z0408742MN1DB2L1IVKL__d501e5c61d85996ce4395a16dfc2859e.links.nickmacioce.com._CNAME]
module.s3.module.isbabymaciocehereyet.aws_route53_record.wildcard_validation["*.isbabymaciocehereyet.com"]: Refreshing state... [id=Z04297862RMBF7HTXKRLG__3a5e9f534e0cc1514e2261d4e69fa372.isbabymaciocehereyet.com._CNAME]
module.s3.module.isbabymaciocehereyet.aws_route53_record.wildcard_validation["isbabymaciocehereyet.com"]: Refreshing state... [id=Z04297862RMBF7HTXKRLG__3a5e9f534e0cc1514e2261d4e69fa372.isbabymaciocehereyet.com._CNAME]
module.s3.module.nickmacioce.aws_route53_record.wildcard_validation["nickmacioce.com"]: Refreshing state... [id=Z0408742MN1DB2L1IVKL__16b994c0d16039e5552bba8bdc404476.nickmacioce.com._CNAME]
module.s3.module.nickmacioce.aws_route53_record.wildcard_validation["*.nickmacioce.com"]: Refreshing state... [id=Z0408742MN1DB2L1IVKL__16b994c0d16039e5552bba8bdc404476.nickmacioce.com._CNAME]
module.s3.module.links-nickmacioce.aws_acm_certificate_validation.wildcard_cert: Refreshing state... [id=2021-08-15 04:44:20 +0000 UTC]
module.networking.aws_subnet.public_subnet_1: Refreshing state... [id=subnet-097774274a64c6abd]
module.networking.aws_subnet.private_subnet_1: Refreshing state... [id=subnet-01b751997de387cd5]
module.s3.module.isbabymaciocehereyet.aws_acm_certificate_validation.wildcard_cert: Refreshing state... [id=2021-08-15 04:44:12 +0000 UTC]
module.s3.module.nickmacioce.aws_acm_certificate_validation.wildcard_cert: Refreshing state... [id=2021-08-15 04:44:14 +0000 UTC]
module.s3.module.links-nickmacioce.aws_cloudfront_distribution.website_cdn_root: Refreshing state... [id=E1XIU9LHYXL6GI]
module.s3.module.isbabymaciocehereyet.aws_cloudfront_distribution.website_cdn_root: Refreshing state... [id=EKU74NXRQDNYF]
module.s3.module.links-nickmacioce.aws_route53_record.website_cdn_root_record: Refreshing state... [id=Z0408742MN1DB2L1IVKL_links.nickmacioce.com_A]
module.s3.module.nickmacioce.aws_cloudfront_distribution.website_cdn_root: Refreshing state... [id=EWL5EBD36576X]
module.s3.module.isbabymaciocehereyet.aws_route53_record.website_cdn_root_record: Refreshing state... [id=Z04297862RMBF7HTXKRLG_isbabymaciocehereyet.com_A]
module.s3.module.nickmacioce.aws_route53_record.website_cdn_root_record: Refreshing state... [id=Z0408742MN1DB2L1IVKL_nickmacioce.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.networking.aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0b89592ea7423cf94"
    }

  # module.s3.aws_s3_bucket.b will be destroyed
  - resource "aws_s3_bucket" "b" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::macioce-tf-test-bucket" -> null
      - bucket                      = "macioce-tf-test-bucket" -> null
      - bucket_domain_name          = "macioce-tf-test-bucket.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "macioce-tf-test-bucket.s3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "macioce-tf-test-bucket" -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Environment" = "Dev"
          - "Name"        = "My bucket"
        } -> null
      - tags_all                    = {
          - "Environment" = "Dev"
          - "Name"        = "My bucket"
        } -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.s3.module.isbabymaciocehereyet.aws_s3_bucket.website_root will be updated in-place
  ~ resource "aws_s3_bucket" "website_root" {
      ~ acl                         = "public-read" -> "private"
        id                          = "isbabymaciocehereyet.com-root"
        tags                        = {
            "Changed"   = "2021-08-15 04:41 UTC"
            "ManagedBy" = "terraform"
        }
        # (11 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.s3.module.isbabymaciocehereyet.aws_s3_bucket_public_access_block.access_good_1 will be created
  + resource "aws_s3_bucket_public_access_block" "access_good_1" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "isbabymaciocehereyet.com-root"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3.module.links-nickmacioce.aws_s3_bucket.website_root will be updated in-place
  ~ resource "aws_s3_bucket" "website_root" {
      ~ acl                         = "public-read" -> "private"
        id                          = "links.nickmacioce.com-root"
        tags                        = {
            "Changed"   = "2021-08-15 04:41 UTC"
            "ManagedBy" = "terraform"
        }
        # (11 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.s3.module.links-nickmacioce.aws_s3_bucket_public_access_block.access_good_1 will be created
  + resource "aws_s3_bucket_public_access_block" "access_good_1" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "links.nickmacioce.com-root"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3.module.nickmacioce.aws_s3_bucket.website_root will be updated in-place
  ~ resource "aws_s3_bucket" "website_root" {
      ~ acl                         = "public-read" -> "private"
        id                          = "nickmacioce.com-root"
        tags                        = {
            "Changed"   = "2021-08-15 04:41 UTC"
            "ManagedBy" = "terraform"
        }
        # (11 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.s3.module.nickmacioce.aws_s3_bucket_public_access_block.access_good_1 will be created
  + resource "aws_s3_bucket_public_access_block" "access_good_1" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "nickmacioce.com-root"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 4 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
``````

</details>


*Pusher: @ndmacioce, Action: `pull_request`*